In [1]:
print("fdgd")

fdgd

# **My Test Lab**

### **Library**

In [3]:
import pandas as pd
from pandas.io.json import json_normalize  # tranform JSON file into a pandas dataframe

import numpy as np

from bs4 import BeautifulSoup

# Matplotlib and associated plotting modules
import matplotlib.pyplot as plt
import matplotlib.cm as cm
import matplotlib.colors as colors

import seaborn as sns
from urllib.request import urlopen

import requests
# import k-means from clustering stage
from sklearn.cluster import KMeans

import folium # map rendering library
from geopy.geocoders import Nominatim # convert an address into latitude and longitude values

print("Library imported.")

/usr/local/lib/python3.6/dist-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

Library imported.

In [0]:
#df = pd.read_csv("https://github.com/Tariq-Sayed/Rep_Data_Sc1/blob/master/mumbai_venues.csv")

In [0]:
df1 = pd.read_csv("mumbai_neighborhoods.csv")
df2 = pd.read_csv("mumbai_venues.csv")

In [10]:
df1.head()

   Unnamed: 0  index   Neighborhood       Borough   Latitude  Longitude
0           0      0         Colaba  South Mumbai  18.915091  72.825969
1           1      1  Apollo Bandar  South Mumbai  18.918375  72.831443
2           2      2           Fort  South Mumbai  18.933267  72.834515
3           3      3     Churchgate  South Mumbai  18.935957  72.827340
4           4      4  Nariman Point  South Mumbai  18.925951  72.823208

In [11]:
df2.head()

   Unnamed: 0 Neighborhood  ...  Venue Longitude     Venue Category
0           0       Colaba  ...        72.824151        Men's Store
1           1       Colaba  ...        72.827018  German Restaurant
2           2       Colaba  ...        72.821080    Thai Restaurant
3           3       Colaba  ...        72.829185       Dessert Shop
4           4       Colaba  ...        72.821028              Hotel

[5 rows x 8 columns]

### **Inner Join**

In [0]:
df3 = pd.merge(df1,df2,on="Neighborhood",how="inner")